Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/svd/PIC32CX5112MTG128.svd
               <register>
                  <name>P_IER</name>
                  <description>PIO Privilege Interrupt Enable Register (p_iogroup = 0)</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>P0</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P1</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P2</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P3</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P4</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P5</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P6</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P7</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P8</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P9</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P10</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P11</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P12</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P13</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P14</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P15</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P16</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P17</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P18</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P19</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P20</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P21</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P22</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P23</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P24</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P25</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P26</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P27</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P28</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P29</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P30</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P31</name>
                        <description>Input Change Interrupt Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>P_IDR</name>
                  <description>PIO Privilege Interrupt Disable Register (p_iogroup = 0)</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>P0</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P1</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P2</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P3</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P4</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P5</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P6</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P7</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P8</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P9</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P10</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P11</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P12</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P13</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P14</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P15</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P16</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P17</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P18</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P19</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P20</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P21</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P22</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P23</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P24</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P25</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P26</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P27</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P28</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P29</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P30</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P31</name>
                        <description>Input Change Interrupt Disable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
