Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/svd/PIC32CX5112MTG128.svd
            <register>
               <name>WUSR</name>
               <description>Wakeup Status Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WKUPS</name>
                     <description>WKUP Wake-up Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BADXTWKS</name>
                     <description>Slow Crystal Oscillator Frequency Error Wake-up Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FWUPS</name>
                     <description>FWUP Wake-up Status (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMWS</name>
                     <description>VDD3V3 Supply Monitor Wake-up Status (cleared on read)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTS</name>
                     <description>RTT Wake-up Status (cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCS</name>
                     <description>RTC Wake-up Status (cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMRSTS</name>
                     <description>VDD3V3 Supply Monitor Reset Status (cleared on read)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS0</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS1</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS2</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS3</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS4</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS5</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS6</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS7</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS8</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS9</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS10</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS11</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS12</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS13</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS14</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPIS15</name>
                     <description>WKUPx Input Wake-up Status (cleared on read)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Enable Interrupt Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>LPDBC0</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC1</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC2</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC3</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC4</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMEV</name>
                     <description>VDD3V3 Supply Monitor Event Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBATSMEV</name>
                     <description>VBAT Supply Monitor Event Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Disable Interrupt Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>LPDBC0</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC1</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC2</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC3</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC4</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMEV</name>
                     <description>VDD3V3 Supply Monitor Event Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBATSMEV</name>
                     <description>VBAT Supply Monitor Event Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Mask Interrupt Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LPDBC0</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC1</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC2</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC3</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC4</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMEV</name>
                     <description>VDD3V3 Supply Monitor Event Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBATSMEV</name>
                     <description>VBAT Supply Monitor Event Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>Status Interrupt Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LPDBC0</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC1</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC2</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Status (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC3</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Status (cleared on read)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBC4</name>
                     <description>WKUPx Pin Tamper Detection Interrupt Status (cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMEV</name>
                     <description>VDD3V3 Supply Monitor Event Interrupt Status (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBATSMEV</name>
                     <description>VBAT Supply Monitor Event Interrupt Status (cleared on read)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
